# Preprocessing

In [11]:
import mysql.connector as conn 
mydb = conn.connect(host='localhost',user='root',passwd='root')

In [12]:
cursor = mydb.cursor(buffered=True)

In [3]:
#Create database
cursor.execute("create database test1")

In [4]:
cursor.execute("show databases")
cursor.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test1',),
 ('testsudh',),
 ('world',)]

In [5]:
#create table
cursor.execute("use test1")
cursor.execute("create table test1.worker(workerid INT(10),FIRST_NAME VARCHAR(30),DEPARTMENT VARCHAR(30),SALARY INT(10))")
cursor.execute("show tables")
cursor.fetchall()

[('worker',)]

In [6]:
#insert data
cursor.execute("insert into test1.worker values (1,'soham  ','ineuron',12312)")
cursor.execute("insert into test1.worker values (2,'ram  ','ineuron',341)")
cursor.execute("insert into test1.worker values (2,'mohan','ineuron',452345)")
mydb.commit()

In [7]:
cursor.execute("select * from test1.worker")
cursor.fetchall()

[(1, 'soham  ', 'ineuron', 12312),
 (2, 'ram  ', 'ineuron', 341),
 (2, 'mohan', 'ineuron', 452345)]

# Q-1. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [8]:
cursor.execute("update test1.worker set FIRST_NAME = trim(FIRST_NAME)")
mydb.commit()

In [9]:
cursor.execute("select FIRST_NAME from test1.worker")
cursor.fetchall()

[('soham',), ('ram',), ('mohan',)]

# Q-2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [13]:
cursor.execute("select distinct length(DEPARTMENT) from test1.worker")
cursor.fetchall()

[(7,)]

# Q-3. Write an SQL query to fetch nth max salaries from a table.

In [15]:
cursor.execute("select SALARY from test1.worker order by SALARY desc limit 2,1")

In [16]:
cursor.fetchall()

[(341,)]

In [17]:
mydb.close()